In [1]:
import pandas as pd

In [2]:
df=pd.read_csv(r"C:\Users\asus\Desktop\Datasets\crime_dataset_india.csv")
df

,Report Number,Date Reported,Date of Occurrence,Time of Occurrence,City,Crime Code,Crime Description,Victim Age,Victim Gender,Weapon Used,Crime Domain,Police Deployed,Case Closed,Date Case Closed
0,1,02-01-2020 00:00,01-01-2020 00:00,01-01-2020 01:11,Ahmedabad,576,IDENTITY THEFT,16,M,Blunt Object,Violent Crime,13,No,NaN
1,2,01-01-2020 19:00,01-01-2020 01:00,01-01-2020 06:26,Chennai,128,HOMICIDE,37,M,Poison,Other Crime,9,No,NaN
2,3,02-01-2020 05:00,01-01-2020 02:00,01-01-2020 14:30,Ludhiana,271,KIDNAPPING,48,F,Blunt Object,Other Crime,15,No,NaN
3,4,01-01-2020 05:00,01-01-2020 03:00,01-01-2020 14:46,Pune,170,BURGLARY,49,F,Firearm,Other Crime,1,Yes,29-04-2020 05:00
4,5,01-01-2020 21:00,01-01-2020 04:00,01-01-2020 16:51,Pune,421,VANDALISM,30,F,Other,Other Crime,18,Yes,08-01-2020 21:00
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
40155,40156,01-08-2024 16:00,07-31-2024 03:00,31-07-2024 05:05,Kolkata,312,COUNTERFEITING,78,F,Firearm,Other Crime,12,No,NaN
40156,40157,31-07-2024 14:00,07-31-2024 04:00,31-07-2024 04:14,Mumbai,300,ILLEGAL POSSESSION,75,F,NaN,Other Crime,2,Yes,29-09-2024 14:00
40157,40158,02-08-2024 03:00,07-31-2024 05:00,31-07-2024 21:33,Kanpur,423,VEHICLE - STOLEN,68,M,Other,Violent Crime,6,No,NaN
40158,40159,01-08-2024 19:00,07-31-2024 06:00,31-07-2024 11:05,Patna,311,SEXUAL ASSAULT,11,M,Blunt Object,Violent Crime,1,No,NaN
40159,40160,31-07-2024 17:00,07-31-2024 07:00,31-07-2024 17:19,Delhi,193,DOMESTIC VIOLENCE,43,F,Poison,Violent Crime,7,Yes,28-09-2024 17:00

In [5]:
# for find the top cities which have maximum crime
p=df['City'].value_counts()
p

City
Delhi            5400
Mumbai           4415
Bangalore        3588
Hyderabad        2881
Kolkata          2518
Chennai          2493
Pune             2212
Ahmedabad        1817
Jaipur           1479
Lucknow          1456
Kanpur           1112
Surat            1111
Nagpur           1053
Agra              764
Ludhiana          761
Visakhapatnam     728
Thane             706
Ghaziabad         704
Indore            699
Patna             695
Bhopal            690
Meerut            395
Srinagar          371
Nashik            366
Vasai             362
Varanasi          355
Kalyan            355
Faridabad         354
Rajkot            320
Name: count, dtype: int64

In [7]:
# for find top 10 cities which have maximum crime case.
p.head(10)

City
Delhi        5400
Mumbai       4415
Bangalore    3588
Hyderabad    2881
Kolkata      2518
Chennai      2493
Pune         2212
Ahmedabad    1817
Jaipur       1479
Lucknow      1456
Name: count, dtype: int64

In [12]:
# for find the Male/Female candidate in those top 10 cities.
e=df[['City','Victim Gender']].value_counts()
e

City       Victim Gender
Delhi      F                2956
Mumbai     F                2495
Bangalore  F                2042
Delhi      M                1858
Hyderabad  F                1579
                            ...
Varanasi   X                  43
Nashik     X                  38
Meerut     X                  37
Faridabad  X                  34
Rajkot     X                  26
Name: count, Length: 87, dtype: int64

In [13]:
e.head(10)

City       Victim Gender
Delhi      F                2956
Mumbai     F                2495
Bangalore  F                2042
Delhi      M                1858
Hyderabad  F                1579
Mumbai     M                1445
Kolkata    F                1413
Chennai    F                1320
Pune       F                1215
Bangalore  M                1149
Name: count, dtype: int64

In [14]:
# Performing the calculation in rows and columns we can use the three special functions:
# 1. map() : It is used for performing the rows calculation.
# 2. apply() : It is used for performing the columns calculation.
# 3. applymap() : It is used for overall calculation means that apply allover the entire data rows and columns.

In [19]:
e2=df[['Crime Code','Victim Age','Police Deployed']]
e2

       Crime Code  Victim Age  Police Deployed
0             576          16               13
1             128          37                9
2             271          48               15
3             170          49                1
4             421          30               18
...           ...         ...              ...
40155         312          78               12
40156         300          75                2
40157         423          68                6
40158         311          11                1
40159         193          43                7

[40160 rows x 3 columns]

In [20]:
e2.head(10)

   Crime Code  Victim Age  Police Deployed
0         576          16               13
1         128          37                9
2         271          48               15
3         170          49                1
4         421          30               18
5         442          16               18
6         172          64               13
7         169          78                8
8         338          41                1
9         497          29                4

In [23]:
h=list(map(lambda x:x-(x*5/100),e2))
df['5%']=h

TypeError: unsupported operand type(s) for /: 'str' and 'int'